

movies_db = {
    "драма": [
        {
            "title": "Втеча з Шоушенка",
            "description": "Два ув'язнені чоловіки зближуються протягом багатьох років, знаходячи розраду та остаточне спокутування через акти загальної порядності.",
            "rating": 9.3,
            "price": 60
        },
        {
            "title": "Зелена миля",
            "description": "На життя охоронців блоку смертників впливає один із їхніх підопічних: чорношкірий чоловік, звинувачений у вбивстві та зґвалтуванні дитини, але який має таємничий дар.",
            "rating": 8.6,
            "price": 60
        },
    ],
    "комедія": [
        {
            "title": "Один вдома",
            "description": "Восьмирічний бешкетник повинен захистити свій будинок від пари грабіжників, коли його випадково залишили одного вдома члени його родини під час різдвяних канікул.",
            "rating": 7.7,
            "price": 60
        },
        {
            "title": "Маска",
            "description": "Банківський клерк Стенлі Іпкіс перетворюється на пустотливого супергероя, коли одягає таємничу маску.",
            "rating": 6.9,
            "price": 60
        },
    ],
    "бойовик": [
        {
            "title": "Темний лицар",
            "description": "Коли загроза, відома як Джокер, сіє хаос і хаос серед жителів Ґотема, Бетмен повинен прийняти один із найбільших психологічних і фізичних випробувань своєї здатності боротися з несправедливістю.",
            "rating": 9.0,
            "price": 60
        },
        {
            "title": "Матриця",
            "description": "Комп'ютерний хакер дізнається від таємничих повстанців про справжню природу своєї реальності та свою роль у війні проти її контролерів.",
            "rating": 8.7,
            "price": 60
        }
    ]
}

def get_genres():
    """Повертає список доступних жанрів."""
    return list(movies_db.keys())

def get_movies_by_genre(genre: str):
    """Повертає список фільмів для вказаного жанру."""
    return movies_db.get(genre, [])

def find_movie_by_title(title: str):
    """Знаходить фільм за назвою у всіх жанрах."""
    for genre_movies in movies_db.values():
        for movie in genre_movies:
            if movie["title"] == title:
                return movie
    return None